Repository: BurakKontas/localizator
Catalog: Localizator.Shared/Resources/Errors.*.resx
Languages: tr

# BasicAuthorizationHeaderInvalidFormat
source: Authorization header doesn't start with Basic
tr: Authorization header'i"Basic" ile başlamıyor

source: Authorization header not found
tr: Authorization header'i bulunamadı

source: Base64 conversion error
tr: Base64 dönüşüm hatası

source: Basic Credentials don't match
tr: Basic Authentication kimlik bilgileri uyuşmuyor

# FailedToCreateIdentityUser
source: Failed to create identity user: {0}
tr: Identity kullanıcısı oluşturulamadı: {0}

source: Invalid credential format
tr: Geçersiz kimlik bilgisi formatı

# FailedToCreateDevUser
source: Failed to create development user: {0}
tr: Development kullanıcısı oluşturulamadı: {0}

# ContextResourceIsNotHttpContext
source: context.Resource is not Microsoft.AspNetCore.Http.HttpContext
tr: context.Resource Microsoft.AspNetCore.Http.HttpContext tipinde değil

source: NameIdentifier claim missing
tr: NameIdentifier claim’i bulunamadı

source: Invalid or missing API Key
tr: Geçersiz yada eksik API Key

# ResourceNotFound
source: Resource not found in environment ({0})
tr: Çevre değişkeni bulunamadı ({0})

# HandlerMethodNotFound
source: Handler method not found for {0}
tr: {0} için Handler metodu bulunamadı

source: An error occured.
tr: Beklenmeyen bir hata oluştu.

# InternalServerError
source: An internal server error occurred.
tr: Sunucu tarafında bir hata oluştu.

# InvalidRequest
source: The request is invalid.
tr: İstek geçersiz.

# ValidationFailed
source: One or more validation errors occurred.
tr: Bir veya daha fazla doğrulama hatası oluştu.

# Unauthorized
source: You are not authorized to perform this action.
tr: Bu işlemi yapmaya yetkiniz yok.

# Forbidden
source: You do not have permission to access this resource.
tr: Bu kaynağa erişim izniniz yok.

# RequestTimeout
source: The request timed out.
tr: İstek zaman aşımına uğradı.

# RequestCancelled
source: The request was cancelled by the client.
tr: İstek istemci tarafından iptal edildi.

# NotImplemented
source: This functionality is not implemented.
tr: Bu işlev henüz uygulanmamış.

# BadGateway
source: Bad gateway error occurred.
tr: Ağ geçidi hatası oluştu.

source: Invalid authorization scheme.
tr: Geçersiz doğrulama şeması.

source: Bearer token missing.
tr: Bearer tokeni eksik.

source: User identifier missing
tr: Kullanıcı tanımlayıcısı eksik.

# InvalidOIDCToken
source: OIDC token validation failed.
tr: OIDC token doğrulaması başarısız.

source: Namespace name cannot be empty
tr: Namespace adı boş olamaz

# NamespaceNameTooLong
source: Namespace name cannot exceed 100 characters
tr: Namespace adı 100 karakteri geçemez

source: Namespace slug cannot be empty
tr: Namespace slug'ı boş olamaz

# NamespaceSlugInvalidFormat
source: Namespace slug can only contain lowercase letters, numbers and hyphens
tr: Namespace slug'ı sadece küçük harf, sayı ve tire içerebilir

# NamespaceSlugTooLong
source: Namespace slug cannot exceed 50 characters
tr: Namespace slug'ı 50 karakteri geçemez

# NamespaceStatusCannotBeEmpty
source: Status cannot be empty
tr: Durum boş olamaz

# NamespaceStatusInvalid
source: Invalid status. Must be one of: {0}
tr: Geçersiz durum. Şunlardan biri olmalı: {0}

# NamespaceVersionCannotBeEmpty
source: Version cannot be empty
tr: Versiyon boş olamaz

# NamespaceVersionInvalidFormat
source: Version must follow semantic versioning (e.g., 1.0.0)
tr: Versiyon semantic versioning kurallarına uymalı (örn: 1.0.0)

source: Publisher identifier cannot be empty
tr: Yayınlayan tanımlayıcısı boş olamaz

# AtLeastOneLanguageRequired
source: At least one language must be supported
tr: En az bir dil desteklenmeli

# InvalidLanguageCode
source: All language codes must be 2-letter ISO codes
tr: Tüm dil kodları 2 harfli ISO kodları olmalı

# PublishedDateCannotBeFuture
source: Published date cannot be in the future
tr: Yayınlanma tarihi gelecekte olamaz

source: NamespaceId cannot be empty
tr: Namespace ID'si boş olamaz

# CannotUpdateArchivedNamespace
source: Cannot update name of archived namespace
tr: Arşivlenmiş namespace'in adı güncellenemez

# CannotChangePublishedSlug
source: Cannot change slug of published or archived namespace
tr: Yayınlanmış veya arşivlenmiş namespace'in slug'ı değiştirilemez

# NamespaceAlreadyPublished
source: Namespace is already published
tr: Namespace zaten yayınlanmış

source: Cannot publish archived namespace
tr: Arşivlenmiş namespace yayınlanamaz

# NamespaceAlreadyDraft
source: Namespace is already in draft status
tr: Namespace zaten taslak durumunda

source: Cannot unpublish archived namespace
tr: Arşivlenmiş namespace yayından kaldırılamaz

# NamespaceAlreadyArchived
source: Namespace is already archived
tr: Namespace zaten arşivlenmiş

# OnlyArchivedCanBeRestored
source: Only archived namespaces can be restored
tr: Sadece arşivlenmiş namespace'ler geri yüklenebilir

source: Cannot modify archived namespace
tr: Arşivlenmiş namespace değiştirilemez

# NamespaceMustSupportOneLanguage
source: Namespace must support at least one language
tr: Namespace en az bir dili desteklemeli

source: Invalid version bump type
tr: Geçersiz versiyon artırma tipi

source: Namespace permission cannot be null.
tr: Namespace izni boş olamaz.

source: Invalid namespace permission.
tr: Geçersiz namespace yetkisi.
